bookers2-a-review/app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book_new = Book.new
    @book = Book.find(params[:id])

SELECT "books".* FROM "books"
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 3], ["id", 2]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?)  [["book_id", 1], ["book_id", 2]]
SELECT COUNT(*) FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ? AND "users"."created_at" BETWEEN ? AND ?  [["book_id", 1], ["created_at", "2021-06-07 00:00:00"], ["created_at", "2021-06-14 23:59:59.999999"]]
SELECT COUNT(*) FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ? AND "users"."created_at" BETWEEN ? AND ?  [["book_id", 2], ["created_at", "2021-06-07 00:00:00"], ["created_at", "2021-06-14 23:59:59.999999"]]
---
  def index
    @books = Book.includes(:favorited_users).sort{|a, b|
    a.favorited_users.includes(:favorites).where(created_at: 1.week.ago.beginning_of_day..Time.zone.now.end_of_day).size <=>
    b.favorited_users.includes(:favorites).where(created_at: 1.week.ago.beginning_of_day..Time.zone.now.end_of_day).size